app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-08-13 21:14:21.379363"], ["updated_at", "2018-08-13 21:14:21.379363"]]
---
  def create
    @school_class = SchoolClass.new(params.require(:school_class))
    # @school_class.title = params[:title]
    # @school_class.room_number = params[:room_number]
    @school_class.save