app/controllers/students_controller.rb

  def create
    @student = Student.new(params.require(:student))
    # @student = Student.new
    # @student.first_name = params[:first_name]
    # @student.last_name = params[:last_name]
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-08-13 21:14:21.401753"], ["updated_at", "2018-08-13 21:14:21.401753"]]